
{
  "title":"Using Graphs to Model Problems, Part 2",
  "content":"« Previous | Next »\nSession Overview This lecture returns to graph theory. It defines and gives examples of some classic graph problems: shortest path, shortest weighted path, cliques, and min-cut. It then shows how memoization can be used to speed up some algorithms.\nCenters for Disease Control and Prevention. This image is in the public domain.\nSession Activities Lecture Videos Lecture 22: Using Graphs to Model Problems, Part 2 About this Video Topics covered: Dynamic programming, optimal path, overlapping subproblems, weighted edges, specifications, restrictions, efficiency, pseudo-polynomials.\nResources Lecture code handout (PDF) Lecture code (PY) Recitation Videos Recitation 9: Directed and Undirected Node Graphs About this Video Topics covered: Node graphs, nodes, edges, directed and undirected graphs, weighted edges, depth-first search, breadth-first search, graph cycles, children of nodes, shortest path, lambda functions.\nCheck Yourself What is memoization?\n› View/hide answer\nMemoization involves saving work that we\u0026rsquo;ve done to a table, so that in the future, we can look it up rather than recalculating.\nWhy is memoization important?\n› View/hide answer\nIt helps us avoid redoing work that we have already done, thereby making programs more efficient. It is the key idea behind the programming techniques known as dynamic programming.\nProblem Sets Problem Set 10: Clustering (Due) Every decade, the United States Census takes place. The census collects a lot of information from the population around the United States. In this problem set, we are going to use k-means clustering to analyze this information.\nInstructions (PDF) Code Files (ZIP) (This ZIP file contains: 1 .py file and 1 .txt file.) Note: Solutions are not available for this assignment.\nProblem Set 11 (Assigned) Problem set 11 is assigned in this session. The instructions and solutions can be found on the session page where it is due, Lecture 24 Avoiding Statistical Fallacies.\n« Previous | Next »\n"}


