
{
  "title":"Debugging",
  "content":"« Previous | Next »\nSession Overview This lecture starts with a brief explanation of why floating point numbers are only an approximation of the real numbers. Most of the lecture is about a systematic approach to debugging.\nImage courtesy of the Naval Surface Warfare Center, Dahlgren, VA.\nSession Activities Lecture Videos Lecture 7: Debugging About this Video Topics covered: Binary, float, floating point, approximations, debugging, runtime error.\nResources Lecture code handout (PDF) Lecture code (PY) Lecture slides (PDF) Recitation Videos Recitation 4: Recursion, Pseudo code and Debugging About this Video\nTopics covered: Recursion, divide and conquer, base cases, iterative vs. recursive algorithms, Fibonacci numbers example, recursive bisection search, optional and default parameters, pseudo code, introduction to debugging, test cases and edge cases, and floating points.\nCheck Yourself Why do computers use binary representations?\n› View/hide answer\nIt\u0026rsquo;s easy to build hardware with two states, on and off.\nWhy shouldn\u0026rsquo;t we test for equality with floats?\n› View/hide answer\nBecause computers use binary, floats are actually very close approximations of the actual values. Testing for equality can result in an unexpected error, so it\u0026rsquo;s better to determine whether two numbers are close enough for our purposes rather than precisely equal.\nWhen debugging, how can you ensure that the values in your program are the ones you think they are?\n› View/hide answer\nUse print statements.\nProblem Sets Problem Set 3: Wordgames (Due) In this problem set, you\u0026rsquo;ll implement two versions of the 6.00 wordgame! Don\u0026rsquo;t be intimidated by the length of this problem set. It\u0026rsquo;s a lot of reading, but it is very doable.\nLet\u0026rsquo;s begin by describing the 6.00 wordgame: This game is a lot like Scrabble or Text Twist, if you\u0026rsquo;ve played those. Letters are dealt to players, who then construct one or more words out of their letters. Each valid word receives a score, based on the length of the word and the letters in that word.\nInstructions (PDF) Code files (ZIP) (This ZIP file contains: 1 .txt file and 4 .py files.) Solutions (ZIP) (This ZIP file contains: 2 .py files.) Problem Set 4 (Assigned) Problem set 4 is assigned in this session. The instructions and solutions can be found on the session page where it is due, Lecture 10 Hashing and Classes.\nFurther Study These optional resources are provided for students that wish to explore this topic more fully.\nReadings After watching the lecture, you may want to read some of the following resources:\n8. Errors and Exceptions. Python Tutorial. Appendix A: Debugging. How to Think Like a Computer Scientist. « Previous | Next »\n"}


