
{
  "title":"Using Randomness to Solve Non-random Problems",
  "content":"« Previous | Next »\nSession Overview This lecture starts by defining normal (Gaussian), uniform, and exponential distributions. It then shows how Monte Carlo simulations can be used to analyze the classic Monty Hall problem and to find an approximate value of pi.\nImage courtesy of Xiaozhuli on Flickr.\nSession Activities Lecture Videos Lecture 16: Using Randomness to Solve Non-random Problems About this Video Topics covered: Gaussian distributions, analytical models, simulations, exponential growth, probability, distributions, Monty Hall problem.\nResources Lecture code handout (PDF) Lecture code (PY) Check Yourself What is a Gaussian distribution?\n› View/hide answer\nAlso known as a normal distribution, a Gaussian distribution is symmetric and can be fully characterized by its mean and standard deviation.\nWhat is a uniform distribution?\n› View/hide answer\nOne where each outcome has the same probability. The distribution can be fully characterized with a single parameter, the range.\nWhat is important about an exponential distribution?\n› View/hide answer\nThis is the only continuous memory-less distribution, meaning that the probability of any outcome at a point in time is independent of the outcome at any previous time.\nProblem Sets Problem Set 7: Simulating The Spread of Disease and Virus Population (Due) In this problem set, using Python and pylab you will design and implement a stochastic simulation of patient and virus population dynamics, and reach conclusions about treatment regimens based on the simulation results.\nInstructions (PDF) Code File (PY) Solutions (ZIP) (This ZIP file contains: 2 .pdf files and 1 .py file.) Problem Set 8 (Assigned) Problem set 8 is assigned in this session. The instructions and solutions can be found on the session page where it is due, Lecture 18 Optimization Problems and Algorithms.\nFurther Study These optional resources are provided for students that wish to explore this topic more fully.\nMonte Carlo method. Wikipedia. Matplotlib « Previous | Next »\n"}


