
{
  "title":"Software",
  "content":"« Previous | Next »\nIn 6.00, we will use the Python programming language. You\u0026rsquo;ll also need an editor and/or development environment for writing and debugging your programs. In 6.00, we will be using IDLE, a programming environment specially designed for Python programming and included with the Python distribution. These programs are available for installation on your personal computers (see below).\nWhy Python? A programming language is the tool we use to construct a sequence of instructions that will tell the computer what we want it to do. There are hundreds of programming languages in the world. Over the course of my career, I\u0026rsquo;ve taught programming classes using at least six different languages.\nThere is no best language (though I could nominate some candidates for worst). Different languages are better or worse for different kinds of applications. MATLAB, for example, is a great language for manipulating vectors and matrices. C is a good language for writing the programs that control data networks.\nIn this course, we will use Python. Python is a relatively recent addition to the universe of languages, and is still growing in popularity. I want to emphasize that this course is not about Python. You will certainly learn Python, and that\u0026rsquo;s a good thing. What is much more important, however, is that you will learn how to write programs that solve problems, given a set of basic primitives, and ways of combining them into more complex elements, that you can then abstract into primitives. This skill can be transferred to many languages.\nSetting Up Python You can install the 6.00 software on your personal computer if your operating system is GNU/Linux, Windows (7/XP), or MacOS X. For Windows, you will need Python version 2.5.4, while for OS X you\u0026rsquo;ll need Python 2.7.11 (any 2.5.x, 2.6.x, or 2.7.x version of Python will work, but 3.0 versions are NOT compatible). Below are direct links to the most common Python installers:\nWindows:\nDownload and install: Windows Installer\nMac OS X:\nFor OS X Yosemite and earlier, download and install: Mac Installer. For OS X El Capitan and later, download and install Anaconda with Python 2.7 for OS X. Anaconda comes with numpy and matplotlib preinstalled, along with many other python libraries, so you may ignore the installation instructions for those libraries in Pset 6.\nWarning: On the Python homepage, the latest version available for download is actually 3.5. Do not install this! This version is not backwards compatible with the code that you\u0026rsquo;ll be writing in this course (for example, you have to type print(\u0026ldquo;test\u0026rdquo;) instead of print \u0026ldquo;test\u0026rdquo;). Instead, be sure to download the version listed above.\nUsing IDLE IDLE is the standard Python development environment. Its name is an acronym of \u0026ldquo;Integrated DeveLopment Environment\u0026rdquo;. It works well on both Unix and Windows platforms.\nIt has a Python shell window, which gives you access to the Python interactive mode. It also has a file editor that lets you create and edit existing Python source files.\nDuring the following discussion of IDLE\u0026rsquo;s features, instead of passively reading along, you should start IDLE and try to replicate the actions.\nYou can type Python code directly into this shell, at the \u0026lsquo;\u0026raquo;\u0026gt;\u0026rsquo; prompt. Whenever you enter a complete code fragment, it will be executed. For instance, typing:\n\u0026gt;\u0026raquo; print \u0026ldquo;hello world\u0026rdquo;\nand pressing Enter will cause the following to be displayed:\nhello world\nIDLE can also be used as a calculator:\n\u0026gt;\u0026raquo; 4+4\n8\nAddition, subtraction, and multiplication operators are built into the Python language. This means you can use them right away. If you want to use a square root in your calculation, you need to import the math module. Do not worry about what it means right now; we will cover this later during the course. Below is an example of square root calculation:\n\u0026gt;\u0026raquo; import math\n\u0026gt;\u0026raquo; math.sqrt(16)\n4.0\nMath module allows you to do a number of useful operations:\n\u0026gt;\u0026raquo; import math\n\u0026gt;\u0026raquo; math.pow(3, 2)\n9.0\n\u0026gt;\u0026raquo; math.cos( 0 )\n1.0\nNote that you only need to execute the import command once after you start IDLE.\nExercises\nFor additional practice, try using IDLE to calculate:\n23.0 to the 5th power Positive root of the following equation:\n34*x^2 + 68*x - 510\nRecall:\na*x^2 + b*x + c\nx1 = ( - b + sqrt ( b*b - 4*a*c ) ) / ( 2*a ) « Previous | Next »\n"}


