
{
  "title":"Sampling and Monte Carlo Simulation",
  "content":"« Previous | Next »\nSession Overview This lecture starts with some examples of how to use pylab\u0026rsquo;s plotting mechanisms. It then returns to the topic of using probability and statistics to derive information from samples.\nSession Activities Lecture Videos Lecture 14: Sampling and Monte Carlo Simulation About this Video Topics covered: Plotting, randomness, probability, Pascal\u0026rsquo;s algorithm, Monte Carlo simulation, inferential statistics, gambler\u0026rsquo;s fallacy, law of large numbers.\nResources Lecture code handout (PDF) Lecture code (PY) Check Yourself Can probabilities be added?\n› View/hide answer\nIn general, one cannot add probabilities.\nWhat is a Monte Carlo simulation?\n› View/hide answer\nA simulation which arrives at an approximation of a probability by running many, many trials.\nWhat is the guiding principle of inferential statistics?\n› View/hide answer\nA random sample tends to exhibit the same properties as the population from which it is drawn.\nWhat is the law of large numbers (a.k.a. Bernoulli\u0026rsquo;s Law)?\n› View/hide answer\nThe law of large numbers basically says that using more test cases in a simulation involving randomness will increase our confidence in its results.\nWhat is the gambler\u0026rsquo;s fallacy?\n› View/hide answer\nThe belief that random numbers will even out constantly (e.g. that after a string of heads, it\u0026rsquo;s “time for” the coin to come up tails.)\nProblem Sets Problem Set 6: Simulating Robots (Due) In this problem set you will practice designing a simulation and implementing a program that uses classes.\nInstructions (PDF) Code Files (ZIP) (This ZIP file contains: 3 .py files.) Solutions (ZIP) (This ZIP file contains: 1 .py file.) Problem Set 7 (Assigned) Problem set 7 is assigned in this session. The instructions and solutions can be found on the session page when it is due, Lecture 16 Using Randomness to Solve Non-random Problems.\nFurther Study These optional resources are provided for students that wish to explore this topic more fully.\nReadings Monte Carlo method. Wikipedia. « Previous | Next »\n"}


