
{
  "title":"Avoiding Statistical Fallacies",
  "content":"« Previous | Next »\nSession Overview This lecture discusses some common ways that people use statistics to draw invalid or misleading conclusions.\nImage courtesy of spweber on Flickr.\nSession Activities Lecture Videos Lecture 24: Avoiding Statistical Fallacies About this Video Topics covered: Statistics, plotting, correlation, causation, bias, logical fallacies, data enhancement, Texas sharpshooter fallacy.\nResources Lecture code handout (PDF) Lecture code (PY) Lecture slides (PDF) Recitation Videos Recitation 10: Introduction to Dynamic Programming About this Video Topics covered: Dynamic programming, memoization, overlapping subproblems, optional substructure, Fibonacci memoization example.\nCheck Yourself What does GIGO stand for?\n› View/hide answer\nGarbage In Garbage Out: if your data is flawed, any conclusions you draw from it will be, too.\nWhat does \u0026lsquo;cum hoc ergo propter hoc\u0026rsquo; mean?\n› View/hide answer\nIt is Latin for \u0026ldquo;with this, therefore because of this,\u0026rdquo; a logical fallacy which involves incorrectly inferring a causation from a correlation. You should always remember—correlation does not imply causation.\nWhat is a lurking variable?\n› View/hide answer\nOne which doesn\u0026rsquo;t appear in the plot of two other variables, but could have an effect on both. It is also sometimes referred to as a confounding variable.\nProblem Sets Problem Set 11: Fastest Way to Get Around MIT (Due) In this problem set you will write a solution to an optimization problem on how to find the shortest route from one building to another on the MIT campus given that you wish to constrain the amount of time you will spend walking outdoors (because generally speaking, the nocturnal beaver… err, um, the nocturnal MIT engineer… hates the sun).\nInstructions (PDF) Code Files (ZIP) (This ZIP file contains: 1 .txt file and 2 .py files.) Note: Solutions are not available for this assignment.\nFurther Study These optional resources are provided for students that wish to explore this topic more fully.\n7.2 Reading and Writing Files. Python Tutorial. « Previous | Next »\n"}


