
{
  "title":"Resource Index",
  "content":"« Previous\nThis resource index gives users access to most of the course resources in a single location.\nUnit 1 TITLES LECTURE VIDEOS LECTURE SLIDES LECTURE RESOURCES RECITATION VIDEOS PROBLEM SETS FURTHER STUDY LINKS Introduction to 6.00 Lecture 1: Introduction to 6.00 Lecture slides (PDF) None None Instructions (PDF)\nSolutions (ZIP)\nReadings The Python Standard Library 6.01SC Introduction to Electrical Engineering and Computer Science I Core Elements of a Program Lecture 2: Core Elements of a Program None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 1: Introduction to Coding Concepts Instructions (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nNone Problem Solving Lecture 3: Problem Solving None Lecture code handout (PDF)\nLecture code (PY)\nNone Instructions (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nReadings Loops. An Introduction to Python. Machine Interpretation of a Program Lecture 4: Machine Interpretation of a Program None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 2: Loops, Tuples, Strings and Functions Instructions (PDF)\nPseudocode (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nNone Objects in Python Lecture 5: Objects in Python None Lecture code handout (PDF)\nLecture code (PY)\nNone Instructions (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nReadings 8. Lists. How to Think Like a Computer Scientist. 9. Tuples. How to Think Like a Computer Scientist. 10. Dictionaries. How to Think Like a Computer Scientist. 5.1 More on Lists. Python Tutorial. 5.3 Tuples as Sequences. Python Tutorial. 5.5 Dictionaries. Python Tutorial. Recursion Lecture 6: Recursion None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 3: Lists and their Elements, Sorting, and Recursion Instructions (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nReadings 4.9 Recursion. How to Think Like a Computer Scientist. Recursion. An Introduction to Python. Comparing Recursion and Looping. An Introduction to Python. Related Lectures 6.006 Introduction to Algorithms. 6.006 lectures assume a greater level of mathematical sophistication than does 6.00SC. Read the lecture notes on: Dynamic programming I: memoization, Fibonacci, Crazy Eights, guessing Debugging Lecture 7: Debugging Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nRecitation 4: Recursion, Pseudo code and Debugging Instructions (PDF)\nCode File (PY)\nSolutions (ZIP)\nReadings 8. Errors and Exceptions. Python Tutorial. Appendix A: Debugging. How to Think Like a Computer Scientist. Efficiency and Order of Growth Lecture 8: Efficiency and Order of Growth None Lecture code handout (PDF)\nLecture code (PY)\nshowGrowth code (PY)\nOptional Recitation: Algorithm Complexity and Class Review Instructions (PDF)\nCode Files (ZIP)\nSolutions (ZIP)\nNone Memory and Search Methods Lecture 9: Memory and Search Methods None Lecture code handout (PDF)\nLecture code (PY)\nNone Instructions (PDF)\nCode Files (ZIP)\nNote: Solutions are not available for this assignment.\nReadings 8.7. Sets—Unordered collections of unique elements. Python Standard Library. Related Lectures 6.01SC Introduction to Electrical Engineering and Computer Science I. Search Algorithms Optimizing a search 6.006 Introduction to Algorithms. 6.006 lectures assume a greater level of mathematical sophistication than does 6.00SC. Read the lecture notes on: Binary search trees Sorting Searching Quiz I QUIZ SCOPE PREPARATION AND CONTENT REVIEW QUIZ PROBLEMS AND SOLUTIONS Quiz 1 Quiz 1 Topics List (PDF)\nPractice Quiz 1 (PDF) Quiz 1 Problems (PDF)\nQuiz 1 Solutions (PDF)\nUnit 2 TITLES LECTURE VIDEOS LECTURE SLIDES LECTURE RESOURCES RECITATION VIDEOS PROBLEM SETS FURTHER STUDY LINKS Hashing and Classes Lecture 10: Hashing and Classes None Lecture code handout (PDF)\nLecture code (PY)\nNone Instructions (PDF)\nCode Files (ZIP)\nNote: Solutions are not available for this assignment.\nReadings 12. Classes and objects. How to Think Like a Computer Scientist. Related Lectures 6.006 Introduction to Algorithms. 6.006 lectures assume a greater level of mathematical sophistication than does 6.00SC. Read the lecture notes on: Hashing I: Chaining, hash functions Hashing II: Table doubling, Karp-Rabin Hashing III: Open addressing OOP and Inheritance Lecture 11: OOP and Inheritance None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 5: Quiz 1 Answers and Object-Oriented Programming Instructions (PDF)\nCode Files (ZIP)\nNote: Solutions are not available for this assignment.\nNone Introduction to Simulation and Random Walks Lecture 12: Introduction to Simulation and Random Walks None Lecture code handout (PDF)\nLecture code (PY)\nNone None None Some Basic Probability and Plotting Data Lecture 13: Some Basic Probability and Plotting Data None Lecture code handout (PDF)\nLecture code (PY)\nNone None None Sampling and Monte Carlo Simulation Lecture 14: Sampling and Monte Carlo Simulation None Lecture code handout (PDF)\nLecture code (PY)\nNone None Readings Monte Carlo method. Wikipedia. Statistical Thinking Lecture 15: Statistical Thinking None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 6: Probability and Statistics None None Using Randomness to Solve Non-random Problems Lecture 16: Using Randomness to Solve Non-random Problems None Lecture code handout (PDF)\nLecture code (PY)\nNone None Monte Carlo method. Wikipedia. Matplotlib Curve Fitting Lecture 17: Curve Fitting Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nLecture data files (ZIP)\nRecitation 7: Distributions, Monte Carlo, and Regressions None None Optimization Problems and Algorithms Lecture 18: Optimization Problems and Algorithms Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nLauncher data file (TXT)\nNone None None More Optimization and Clustering Lecture 19: More Optimization and Clustering Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nNone None None Quiz 2 QUIZ SCOPE PREPARATION AND CONTENT REVIEW QUIZ AND SOLUTIONS Quiz 2 Quiz 2 Topics List (PDF)\nPractice Quiz 2 (PDF)\nQuiz 2 Problems (PDF)\nQuiz 2 Solutions (PDF)\nUnit III TITLES LECTURE VIDEOs LECTURE SLIDES LECTURE RESOURCES RECITATION VIDEOS PROBLEM SETS FURTHER STUDY LINKS More Clustering Lecture 20: More Clustering Lecture slides (PDF)\nLecture code handout (PDF)\nLecture code (PY)\nLecture data files (ZIP)\nRecitation 8: Hierarchical and k-means Clustering None None Using Graphs to Model Problems, Part 1 Lecture 21: Using Graphs to Model Problems, Part 1 Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nNone None None Using Graphs to Model Problems, Part 2 Lecture 22: Using Graphs to Model Problems, Part 2 None Lecture code handout (PDF)\nLecture code (PY)\nRecitation 9: Directed and Undirected Node Graphs None None Dynamic Programming Lecture 23: Dynamic Programming None Lecture code handout (PDF)\nLecture code (PY)\nNone None None Avoiding Statistical Fallacies Lecture 24: Avoiding Statistical Fallacies Lecture slides (PDF) Lecture code handout (PDF)\nLecture code (PY)\nRecitation 10: Introduction to Dynamic Programming None 7.2 Reading and Writing Files. Python Tutorial. Queuing Network Models Lecture 25: Queuing Network Models None Lecture code handout (PDF)\nLecture code (PY)\nBus code (PY) None None None What Do Computer Scientists Do? Lecture 26: What Do Computer Scientists Do? Lecture slides (PDF) None None None None Final Exam FINAL EXAM PREPARATION AND CONTENT REVIEW QUIZ PROBLEMS AND SOLUTIONS Final Exam Quiz 3 Topics List (PDF)\nPractice Quiz 3 (PDF)\nQuiz 3 Code (PY)\nFinal Exam Problems (PDF)\nFinal Exam Solutions (PDF)\n« Previous\n"}


