
{
  "title":"Recursion",
  "content":"« Previous | Next »\nSession Overview This lecture finishes the discussion of dictionaries, then introduces inductive reasoning and recursion. Examples include generating the Fibonacci sequence and solving the Towers of Hanoi problem.\nImage courtesy of Stephen \u0026amp; Claire Farnsworth on Flickr.\nSession Activities Lecture Videos Lecture 6: Recursion About this Video Topics covered: Dictionaries, modular abstraction, divide and conquer, recursion, tower of Hanoi, base case, Fibonacci sequence.\nResources Lecture code handout (PDF) Lecture code (PY) Recitation Videos Recitation 3: Lists and their Elements, Sorting, and Recursion About this Video Topics covered: Tuples, lists, iteration, list elements, sorting lists, mutability, keys, dictionaries, chain method, recursion, base case, Tower of Hanoi.\nCheck Yourself What is recursion?\n› View/hide answer\nRecursion, or \u0026ldquo;divide-and-conquer\u0026rdquo;, allows us to define a function that calls itself to solve a problem by breaking it into simpler cases.\nWhat is a recursive case?\n› View/hide answer\nA recursive case calls the recursive procedure on a simpler case (usually a part of the input).\nWhat is a base case?\n› View/hide answer\nA base case is necessary in recursion; it determines when the procedure returns a value (or terminates), rather than continuing the recursive process.\nProblem Sets Problem Set 2: Successive Approximation and a Wordgame (Due) Successive approximation is a problem-solving method where you try to guess the right answer to a problem and then check your guess. If the guess is good enough, you\u0026rsquo;re done. Otherwise, you keep improving your guess in small increments and checking it, getting closer and closer to the right answer, until you determine that the guess is good enough. For the first 3 problems of this problem set, we will look at Newton\u0026rsquo;s method, which uses successive approximation to find the roots of a function.\nSecondly, we will have some fun with Python, and get some practice using strings and string operations. We would like you to implement the word game Hangman as a 1-player game against the computer.\nInstructions (PDF) Code Files (ZIP) (This ZIP file contains: 1 .txt file and 2 .py files.) Solutions (ZIP) (This ZIP file contains: 3 .py files.) Problem Set 3 (Assigned) Problem set 3 is assigned in this session. The instructions and solutions can be found on the session page where it is due, Lecture 7 Debugging.\nFurther Study These optional resources are provided for students that wish to explore this topic more fully.\nReadings After watching the lecture, you may want to read some of the following resources:\n4.9 Recursion. How to Think Like a Computer Scientist. Recursion. An Introduction to Python. Comparing Recursion and Looping. An Introduction to Python. Related Lectures 6.006 Introduction to Algorithms. 6.006 lectures assume a greater level of mathematical sophistication than does 6.00SC. Read the lecture notes on: Dynamic programming I: memoization, Fibonacci, Crazy Eights, guessing « Previous | Next »\n"}


